/*************************************************************
 *****************************ES8****************************
 *************************************************************/

// ES8中增加了对String补白(格式化)的方式，简单实用

// for(let i = 1; i < 32; i++){
//   if(i < 10){
//     console.log(`0${i}`)
//   }else{
//     console.log(i)
//   }
// }

for(let i = 1; i < 32; i++){
  console.log(i.toString().padStart(2,'0'))
}

// for(let i = 1; i < 32000; i+=1000){
//   console.log(i.toString().padStart(5,'*#'))
// }

// for(let i = 1; i < 32000; i+=1000){
//   console.log(i.toString().padEnd(5,'*#'))
// }